src/DataProcessors/ПомощникПолученияРНПТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПолученияРНПТ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ОснованиеДляПолученияРНПТ</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОКПД2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаПрослеживаемости</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЕдиницаИзмерения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоПрослеживаемости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>23</v8:Digits>
									<v8:FractionDigits>11</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьПервичныйДокумент</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмпортИзЕАЭС</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтранаПроисхождения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СтатусыОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметЦиклаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>СтатусыОтправки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВКонверте</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеПринят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЕстьОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИнвентаризацияЗапасов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>ИнвентаризацияЗапасов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦенностей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Комиссии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОтборов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьМОЛ2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписьПроверяющего</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаСобственностиЦенностей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерииНоменклатуры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отклонение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаУчет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерииНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/ПомощникПолученияРНПТ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Функция заполняет первые два шага в помощнике получения РНПТ
// Провести инвентаризацию и Создать уведомления
//
// Параметры:
//  Параметры - Структура: 
//						- Организация - СправочникСсылка - организация
//						- Период - Дата - дата помощника получения РНПТ
//  АдресРезультата - строка - адрес, куда будет помещен результат 
// 
Функция ДанныеЗаполненияПомощникаПолученияРНПТ(Параметры, АдресРезультата) Экспорт
	
	ДанныеЗаполнения = ПолучитьДанныеЗаполнения(
		Параметры.Период,
		Параметры.Организация);
	
	ПоместитьВоВременноеХранилище(ДанныеЗаполнения, АдресРезультата);
	
КонецФункции

// Создает документы "Уведомление об остатках прослеживаемых товаров"
// и "Уведомление о ввозе прослеживаемых товаров" в фоне.
// 
// Параметры:
//  ПараметрыCоздания - Структура:
//						Дата - Дата - текущая дата
//						Организация - СправочникСсылка.Организации - организация
//						ПериодСобытия - Дата - дата в помощнике, начало месяца
//						ТаблицаОстатков - ТаблицаЗначений - таблица данных, по которым нужно сформировать уведомления об остатках
//						ТаблицаВвоза - ТаблицаЗначений - таблица данных, по которым нужно сформировать уведомления о ввозе
//  АдресРезультата - строка - адрес, куда будет помещен результат 
//
Функция СоздатьУведомленияВФоне(ПараметрыСоздания, АдресРезультата) Экспорт
	
	ТаблицаОстатковСПервичнымиДокументами = ПараметрыСоздания.ТаблицаОстатков;
	ТаблицаВвоза = ПараметрыСоздания.ТаблицаВвоза;
	Организация  = ПараметрыСоздания.Организация;
	
	СоздатьУведомленияОбОстатках(ТаблицаОстатковСПервичнымиДокументами, Организация);
	
	СоздатьУведомленияОВвозе(ТаблицаВвоза, Организация);
	
КонецФункции

// Записывает полученные РНПТ в документ Уведомление об остатках прослеживаемых товаров 
//  и в документ Уведомление о ввозе прослеживаемых товаров
// 
// Параметры:
//  ПараметрыСоздания - Структура:
//						- Организация - СправочникСсылка - организация
//						- ПериодСобытия - Дата - дата помощника получения РНПТ
//  АдресРезультата - строка - адрес, куда будет помещен результат 
// 
Функция ЗаписьПолученныхРНПТВФоне(ПараметрыСоздания, АдресРезультата) Экспорт

	Организация = ПараметрыСоздания.Организация;
	Период = ПараметрыСоздания.ПериодСобытия;
	
	ЗаписатьПолученныеРНПТ(Организация, Период);
	
КонецФункции

// Создает документы по инвентаризации товаров из помощника получения РНПТ
// 
// Параметры:
//  ПараметрыCоздания - Структура:
//						Дата - Дата - текущая дата
//						Организация - СправочникСсылка.Организации - организация
//						ПериодСобытия - Дата - дата в помощнике, начало месяца
//						ТаблицаОстатков - ТаблицаЗначений - таблица данных, по которым нужно сформировать уведомления
//  АдресРезультата - строка - адрес, куда будет помещен результат
//
Функция СоздатьИнвентаризациюОбОстаткахВФоне(ПараметрыСоздания, АдресРезультата) Экспорт

	ТаблицаОстатков = ПараметрыСоздания.ТаблицаОстатков;
	Организация = ПараметрыСоздания.Организация;
	Дата = ПараметрыСоздания.Дата;
	
	СоздатьИнвентаризациюОбОстатках(Дата, Организация, ТаблицаОстатков, АдресРезультата);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СоздатьИнвентаризациюОбОстатках(Дата, Организация, ТаблицаОстатков, АдресРезультата)
	
	МассивСкладов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаОстатков.ВыгрузитьКолонку("Склад"));
	ФильтрПоСкладу = Новый Структура("Склад");
	СписокНоменклатуры = Новый Массив();
	СозданныеДокументы = Новый Массив();
	
	Для каждого ТекущийСклад Из МассивСкладов Цикл
		
		ФильтрПоСкладу.Склад = ТекущийСклад;
		НайденныеСтроки = ТаблицаОстатков.НайтиСтроки(ФильтрПоСкладу);
		
		Для каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			СписокНоменклатуры.Добавить(ТекущаяСтрока.Номенклатура);
		КонецЦикла;
		
		СсылкаНаДокумент = СоздатьИнвентаризациюТовара(Дата, Организация, ТекущийСклад, СписокНоменклатуры);
		
		СозданныеДокументы.Добавить(СсылкаНаДокумент);
		
		СписокНоменклатуры.Очистить();
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(СозданныеДокументы, АдресРезультата);
	
КонецПроцедуры

Функция СоздатьИнвентаризациюТовара(Дата, Организация, ТекущийСклад, СписокНоменклатуры)
	
	НовыйДокумент = Документы.ИнвентаризацияЗапасов.СоздатьДокумент();
	НовыйДокумент.Дата = Дата;
	
	ДанныеЗаполнения = ДанныеЗаполненияИнвентаризации(Дата, Организация, ТекущийСклад, СписокНоменклатуры);
	
	НовыйДокумент.Заполнить(ДанныеЗаполнения);
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции

Функция ДанныеЗаполненияИнвентаризации(Дата, Организация, Склад, СписокНоменклатуры)
	
	ДанныеЗаполнения = Новый Структура();
	
	ДанныеЗаполнения.Вставить("Дата",                 Дата);
	ДанныеЗаполнения.Вставить("Организация",          Организация);
	ДанныеЗаполнения.Вставить("СтруктурнаяЕдиница",                Склад);
	ДанныеЗаполнения.Вставить("СписокНоменклатуры",   СписокНоменклатуры);
	
	Возврат ДанныеЗаполнения;
КонецФункции

Процедура ЗаписатьПолученныеРНПТ(Организация, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Период));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтатусОтправки", Перечисления.СтатусыОтправки.Сдан);
	Запрос.УстановитьПараметр("ПустойРНПТ", ПрослеживаемостьПереопределяемый.ПустоеЗначениеРНПТ());
	
	ТекстЗапросаУведомлениеОбОСтатках = ИнтерфейсыВзаимодействияБРОВызовСервера.ТекстыДляЗапросаДокументовРеализацииПолномочийНО(
		"УведомлениеОбОстаткахПрослеживаемыхТоваров");
	ТекстЗапросаУведомлениеОВвозе = ИнтерфейсыВзаимодействияБРОВызовСервера.ТекстыДляЗапросаДокументовРеализацииПолномочийНО(
		"УведомлениеОВвозеПрослеживаемыхТоваров");
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка КАК Ссылка,
	|	СтатусыОтправки.Статус КАК Статус,
	|	" + ТекстЗапросаУведомлениеОбОСтатках.ПеречислениеКолонок + "
	|ИЗ
	|	Документ.УведомлениеОбОстаткахПрослеживаемыхТоваров КАК УведомлениеОбОстаткахПрослеживаемыхТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
	|		ПО УведомлениеОбОстаткахПрослеживаемыхТоваров.Ссылка = СтатусыОтправки.Объект
	|	" + ТекстЗапросаУведомлениеОбОСтатках.СоединениеСДокументом + "
	|ГДЕ
	|	УведомлениеОбОстаткахПрослеживаемыхТоваров.Организация = &Организация
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.Проведен
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.РНПТ <> """"
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.РНПТ ЕСТЬ НЕ NULL
	|	И СтатусыОтправки.Статус = &СтатусОтправки
	|	И УведомлениеОбОстаткахПрослеживаемыхТоваров.РНПТ = &ПустойРНПТ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка,
	|	СтатусыОтправки.Статус,
	|	" + ТекстЗапросаУведомлениеОВвозе.ПеречислениеКолонок + "
	|ИЗ
	|	Документ.УведомлениеОВвозеПрослеживаемыхТоваров КАК УведомлениеОВвозеПрослеживаемыхТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
	|		ПО УведомлениеОВвозеПрослеживаемыхТоваров.Ссылка = СтатусыОтправки.Объект
	|	" + ТекстЗапросаУведомлениеОВвозе.СоединениеСДокументом + "
	|ГДЕ
	|	УведомлениеОВвозеПрослеживаемыхТоваров.Организация = &Организация
	|	И УведомлениеОВвозеПрослеживаемыхТоваров.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И УведомлениеОВвозеПрослеживаемыхТоваров.Проведен
	|	И СтатусыОтправки.Статус = &СтатусОтправки
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.РНПТ <> """"
	|	И ДокументыРеализацииПолномочийНалоговыхОрганов.РНПТ ЕСТЬ НЕ NULL
	|	И УведомлениеОВвозеПрослеживаемыхТоваров.РНПТ = &ПустойРНПТ";
	
	Выбор = Запрос.Выполнить().Выбрать();
	
	Пока Выбор.Следующий() Цикл
		
		ДокументОбъект = Выбор.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.РНПТ = 
			ПрослеживаемостьПереопределяемый.ПолучитьРНПТНаСервере(Выбор.ДокументыРеализацииПолномочийНО_РНПТ);
		
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьУведомленияОбОстатках(ТаблицаОстатковСПервичнымиДокументами, Организация)
	
	ТаблицаТНВЭД = ТаблицаОстатковСПервичнымиДокументами.Скопировать(,"КодТНВЭД,Основание,ЕдиницаИзмерения,ЕдиницаПрослеживаемости");
	ТаблицаТНВЭД.Свернуть("КодТНВЭД,Основание,ЕдиницаИзмерения,ЕдиницаПрослеживаемости");
	Фильтр = Новый Структура("КодТНВЭД, Основание, ЕдиницаИзмерения");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаОстатковСПервичнымиДокументами) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрокТНВЭД Из ТаблицаТНВЭД Цикл
		
		ДатаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущаяСтрокТНВЭД.Основание, "Дата");
		
		НовыйДокумент = Документы.УведомлениеОбОстаткахПрослеживаемыхТоваров.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовыйДокумент, ТекущаяСтрокТНВЭД);
		
		НовыйДокумент.Дата = ДатаОснования + 1;
		НовыйДокумент.ПервичныйДокумент = ТекущаяСтрокТНВЭД.Основание;
		НовыйДокумент.Организация = Организация;
		
		ТаблицаТовары = НовыйДокумент.Товары;
		
		ЗаполнитьЗначенияСвойств(Фильтр, ТекущаяСтрокТНВЭД);
		НайденныеСтроки = ТаблицаОстатковСПервичнымиДокументами.НайтиСтроки(Фильтр);
		
		Для каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			
			НоваяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			
		КонецЦикла;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьУведомленияОВвозе(ТаблицаВвоза, Организация)
	
	ТаблицаТНВЭД = ТаблицаВвоза.Скопировать(,"КодТНВЭД,Основание,ЕдиницаИзмерения,ЕдиницаПрослеживаемости");
	ТаблицаТНВЭД.Свернуть("КодТНВЭД,Основание,ЕдиницаИзмерения,ЕдиницаПрослеживаемости");
	Фильтр = Новый Структура("КодТНВЭД, Основание, ЕдиницаИзмерения");
	
	Если НЕ ЗначениеЗаполнено(ТаблицаВвоза) Тогда
		Возврат;
	КонецЕсли;
	
	Для каждого ТекущаяСтрокТНВЭД Из ТаблицаТНВЭД Цикл
		
		РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ТекущаяСтрокТНВЭД.Основание, "Дата, Контрагент");
		
		НовыйДокумент = Документы.УведомлениеОВвозеПрослеживаемыхТоваров.СоздатьДокумент();
		
		ЗаполнитьЗначенияСвойств(НовыйДокумент, ТекущаяСтрокТНВЭД);
		
		НовыйДокумент.Дата = РеквизитыОснования.Дата + 1;
		НовыйДокумент.Контрагент = РеквизитыОснования.Контрагент;
		НовыйДокумент.ПервичныйДокумент = ТекущаяСтрокТНВЭД.Основание;
		НовыйДокумент.Организация = Организация;
		
		ТаблицаТовары = НовыйДокумент.Товары;
		
		ЗаполнитьЗначенияСвойств(Фильтр, ТекущаяСтрокТНВЭД);
		НайденныеСтроки = ТаблицаВвоза.НайтиСтроки(Фильтр);
		
		Для каждого ТекущаяСтрока Из НайденныеСтроки Цикл
			НоваяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		КонецЦикла;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьДанныеЗаполнения(Период, Организация)
	
	Результат = Новый Структура("НачальныеДанные");
	
	Результат.НачальныеДанные = ПрослеживаемостьПереопределяемый.ПолучитьНачальныеДанныеДляПомощникаПолученияРНПТ(Период, Организация);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли
